t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG10 register
//
//*************************************************************************************************
#define XBAR_FLG10_MDL1_OUTA    0x1U          // Input Flag for MDL1_OUTA Signal
#define XBAR_FLG10_MDL1_OUTB    0x2U          // Input Flag for MDL1_OUTB Signal
#define XBAR_FLG10_MDL2_OUTA    0x4U          // Input Flag for MDL2_OUTA Signal
#define XBAR_FLG10_MDL2_OUTB    0x8U          // Input Flag for MDL2_OUTB Signal
#define XBAR_FLG10_MDL3_OUTA    0x10U         // Input Flag for MDL3_OUTA Signal
#define XBAR_FLG10_MDL3_OUTB    0x20U         // Input Flag for MDL3_OUTB Signal
#define XBAR_FLG10_MDL4_OUTA    0x40U         // Input Flag for MDL4_OUTA Signal
#define XBAR_FLG10_MDL4_OUTB    0x80U         // Input Flag for MDL4_OUTB Signal
#define XBAR_FLG10_MDL5_OUTA    0x100U        // Input Flag for MDL5_OUTA Signal
#define XBAR_FLG10_MDL5_OUTB    0x200U        // Input Flag for MDL5_OUTB Signal
#define XBAR_FLG10_MDL6_OUTA    0x400U        // Input Flag for MDL6_OUTA Signal
#define XBAR_FLG10_MDL6_OUTB    0x800U        // Input Flag for MDL6_OUTB Signal
#define XBAR_FLG10_MDL7_OUTA    0x1000U       // Input Flag for MDL7_OUTA Signal
#define XBAR_FLG10_MDL7_OUTB    0x2000U       // Input Flag for MDL7_OUTB Signal
#define XBAR_FLG10_MDL8_OUTA    0x4000U       // Input Flag for MDL8_OUTA Signal
#define XBAR_FLG10_MDL8_OUTB    0x8000U       // Input Flag for MDL8_OUTB Signal
#define XBAR_FLG10_MDL9_OUTA    0x10000U      // Input Flag for MDL9_OUTA Signal
#define XBAR_FLG10_MDL9_OUTB    0x20000U      // Input Flag for MDL9_OUTB Signal
#define XBAR_FLG10_MDL10_OUTA   0x40000U      // Input Flag for MDL10_OUTA Signal
#define XBAR_FLG10_MDL10_OUTB   0x80000U      // Input Flag for MDL10_OUTB Signal
#define XBAR_FLG10_MDL11_OUTA   0x100000U     // Input Flag for MDL11_OUTA Signal
#define XBAR_FLG10_MDL11_OUTB   0x200000U     // Input Flag for MDL11_OUTB Signal
#define XBAR_FLG10_MDL12_OUTA   0x400000U     // Input Flag for MDL12_OUTA Signal
#define XBAR_FLG10_MDL12_OUTB   0x800000U     // Input Flag for MDL12_OUTB Signal
#define XBAR_FLG10_MDL13_OUTA   0x1000000U    // Input Flag for MDL13_OUTA Signal
#define XBAR_FLG10_MDL13_OUTB   0x2000000U    // Input Flag for MDL13_OUTB Signal
#define XBAR_FLG10_MDL14_OUTA   0x4000000U    // Input Flag for MDL14_OUTA Signal
#define XBAR_FLG10_MDL14_OUTB   0x8000000U    // Input Flag for MDL14_OUTB Signal
#define XBAR_FLG10_MDL15_OUTA   0x10000000U   // Input Flag for MDL15_OUTA Signal
#define XBAR_FLG10_MDL15_OUTB   0x20000000U   // Input Flag for MDL15_OUTB Signal
#define XBAR_FLG10_MDL16_OUTA   0x40000000U   // Input Flag for MDL16_OUTA Signal
#define XBAR_FLG10_MDL16_OUTB   0x80000000U   // Input Flag for MDL16_OUTB Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG11 register
//
//*************************************************************************************************
#define XBAR_FLG11_MDL17_OUTA   0x1U   // Input Flag for MDL17_OUTA Signal
#define XBAR_FLG11_MDL17_OUTB   0x2U   // Input Flag for MDL17_OUTB Signal
#define XBAR_FLG11_MDL18_OUTA   0x4U   // Input Flag for MDL18_OUTA Signal
#define XBAR_FLG11_MDL18_OUTB   0x8U   // Input Flag for MDL18_OUTB Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG12 register
//
//*************************************************************************************************
#define XBAR_FLG12_CLB1_OUT0   0x1U          // Input Flag for CLB1_OUT0 Signal
#define XBAR_FLG12_CLB1_OUT1   0x2U          // Input Flag for CLB1_OUT1 Signal
#define XBAR_FLG12_CLB1_OUT2   0x4U          // Input Flag for CLB1_OUT2 Signal
#define XBAR_FLG12_CLB1_OUT3   0x8U          // Input Flag for CLB1_OUT3 Signal
#define XBAR_FLG12_CLB1_OUT6   0x10U         // Input Flag for CLB1_OUT6 Signal
#define XBAR_FLG12_CLB1_OUT7   0x20U         // Input Flag for CLB1_OUT7 Signal
#define XBAR_FLG12_CLB2_OUT0   0x40U         // Input Flag for CLB2_OUT0 Signal
#define XBAR_FLG12_CLB2_OUT1   0x80U         // Input Flag for CLB2_OUT1 Signal
#define XBAR_FLG12_CLB2_OUT2   0x100U        // Input Flag for CLB2_OUT2 Signal
#define XBAR_FLG12_CLB2_OUT3   0x200U        // Input Flag for CLB2_OUT3 Signal
#define XBAR_FLG12_CLB2_OUT6   0x400U        // Input Flag for CLB2_OUT6 Signal
#define XBAR_FLG12_CLB2_OUT7   0x800U        // Input Flag for CLB2_OUT7 Signal
#define XBAR_FLG12_CLB3_OUT0   0x1000U       // Input Flag for CLB3_OUT0 Signal
#define XBAR_FLG12_CLB3_OUT1   0x2000U       // Input Flag for CLB3_OUT1 Signal
#define XBAR_FLG12_CLB3_OUT2   0x4000U       // Input Flag for CLB3_OUT2 Signal
#define XBAR_FLG12_CLB3_OUT3   0x8000U       // Input Flag for CLB3_OUT3 Signal
#define XBAR_FLG12_CLB3_OUT6   0x10000U      // Input Flag for CLB3_OUT6 Signal
#define XBAR_FLG12_CLB3_OUT7   0x20000U      // Input Flag for CLB3_OUT7 Signal
#define XBAR_FLG12_CLB4_OUT0   0x40000U      // Input Flag for CLB4_OUT0 Signal
#define XBAR_FLG12_CLB4_OUT1   0x80000U      // Input Flag for CLB4_OUT1 Signal
#define XBAR_FLG12_CLB4_OUT2   0x100000U     // Input Flag for CLB4_OUT2 Signal
#define XBAR_FLG12_CLB4_OUT3   0x200000U     // Input Flag for CLB4_OUT3 Signal
#define XBAR_FLG12_CLB4_OUT6   0x400000U     // Input Flag for CLB4_OUT6 Signal
#define XBAR_FLG12_CLB4_OUT7   0x800000U     // Input Flag for CLB4_OUT7 Signal
#define XBAR_FLG12_CLB5_OUT0   0x1000000U    // Input Flag for CLB5_OUT0 Signal
#define XBAR_FLG12_CLB5_OUT1   0x2000000U    // Input Flag for CLB5_OUT1 Signal
#define XBAR_FLG12_CLB5_OUT2   0x4000000U    // Input Flag for CLB5_OUT2 Signal
#define XBAR_FLG12_CLB5_OUT3   0x8000000U    // Input Flag for CLB5_OUT3 Signal
#define XBAR_FLG12_CLB5_OUT6   0x10000000U   // Input Flag for CLB5_OUT6 Signal
#define XBAR_FLG12_CLB5_OUT7   0x20000000U   // Input Flag for CLB5_OUT7 Signal
#define XBAR_FLG12_CLB6_OUT0   0x40000000U   // Input Flag for CLB6_OUT0 Signal
#define XBAR_FLG12_CLB6_OUT1   0x80000000U   // Input Flag for CLB6_OUT1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG13 register
//
//*************************************************************************************************
#define XBAR_FLG13_CLB6_OUT2         0x1U          // Input Flag for CLB6_OUT2 Signal
#define XBAR_FLG13_CLB6_OUT3         0x2U          // Input Flag for CLB6_OUT3 Signal
#define XBAR_FLG13_CLB6_OUT6         0x4U          // Input Flag for CLB6_OUT6 Signal
#define XBAR_FLG13_CLB6_OUT7         0x8U          // Input Flag for CLB6_OUT7 Signal
#define XBAR_FLG13_XTRIPOUT1         0x10U         // Input Flag for XTRIPOUT1 Signal
#define XBAR_FLG13_XTRIPOUT2         0x20U         // Input Flag for XTRIPOUT2 Signal
#define XBAR_FLG13_XTRIPOUT3         0x40U         // Input Flag for XTRIPOUT3 Signal
#define XBAR_FLG13_XTRIPOUT4         0x80U         // Input Flag for XTRIPOUT4 Signal
#define XBAR_FLG13_XTRIPOUT5         0x100U        // Input Flag for XTRIPOUT5 Signal
#define XBAR_FLG13_XTRIPOUT6         0x200U        // Input Flag for XTRIPOUT6 Signal
#define XBAR_FLG13_XTRIPOUT7         0x400U        // Input Flag for XTRIPOUT7 Signal
#define XBAR_FLG13_XTRIPOUT8         0x800U        // Input Flag for XTRIPOUT8 Signal
#define XBAR_FLG13_ADCA_EXTMUXSEL0   0x1000U       // Input Flag for ADCA_EXTMUXSEL0 Signal
#define XBAR_FLG13_ADCA_EXTMUXSEL1   0x2000U       // Input Flag for ADCA_EXTMUXSEL1 Signal
#define XBAR_FLG13_ADCA_EXTMUXSEL2   0x4000U       // Input Flag for ADCA_EXTMUXSEL2 Signal
#define XBAR_FLG13_ADCA_EXTMUXSEL3   0x8000U       // Input Flag for ADCA_EXTMUXSEL3 Signal
#define XBAR_FLG13_ADCB_EXTMUXSEL0   0x10000U      // Input Flag for ADCB_EXTMUXSEL0 Signal
#define XBAR_FLG13_ADCB_EXTMUXSEL1   0x20000U      // Input Flag for ADCB_EXTMUXSEL1 Signal
#define XBAR_FLG13_ADCB_EXTMUXSEL2   0x40000U      // Input Flag for ADCB_EXTMUXSEL2 Signal
#define XBAR_FLG13_ADCB_EXTMUXSEL3   0x80000U      // Input Flag for ADCB_EXTMUXSEL3 Signal
#define XBAR_FLG13_ADCC_EXTMUXSEL0   0x100000U     // Input Flag for ADCC_EXTMUXSEL0 Signal
#define XBAR_FLG13_ADCC_EXTMUXSEL1   0x200000U     // Input Flag for ADCC_EXTMUXSEL1 Signal
#define XBAR_FLG13_ADCC_EXTMUXSEL2   0x400000U     // Input Flag for ADCC_EXTMUXSEL2 Signal
#define XBAR_FLG13_ADCC_EXTMUXSEL3   0x800000U     // Input Flag for ADCC_EXTMUXSEL3 Signal
#define XBAR_FLG13_PIEERR            0x4000000U    // Input Flag for PIEERR Signal
#define XBAR_FLG13_ECCERR            0x8000000U    // Input Flag for ECCERR Signal
#define XBAR_FLG13_EPG1_EPGOUT0      0x10000000U   // Input Flag for EPG1_EPGOUT0 Signal
#define XBAR_FLG13_EPG1_EPGOUT1      0x20000000U   // Input Flag for EPG1_EPGOUT1 Signal
#define XBAR_FLG13_EPG1_EPGOUT2      0x40000000U   // Input Flag for EPG1_EPGOUT2 Signal
#define XBAR_FLG13_EPG1_EPGOUT3      0x80000000U   // Input Flag for EPG1_EPGOUT3 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG14 register
//
//*************************************************************************************************
#define XBAR_FLG14_SD3FLT1_COMPH        0x1U          // Input Flag for SD3FLT1_COMPH Signal
#define XBAR_FLG14_SD3FLT1_COMPL        0x2U          // Input Flag for SD3FLT1_COMPL Signal
#define XBAR_FLG14_SD3FLT2_COMPH        0x4U          // Input Flag for SD3FLT2_COMPH Signal
#define XBAR_FLG14_SD3FLT2_COMPL        0x8U          // Input Flag for SD3FLT2_COMPL Signal
#define XBAR_FLG14_SD3FLT3_COMPH        0x10U         // Input Flag for SD3FLT3_COMPH Signal
#define XBAR_FLG14_SD3FLT3_COMPL        0x20U         // Input Flag for SD3FLT3_COMPL Signal
#define XBAR_FLG14_SD3FLT4_COMPH        0x40U         // Input Flag for SD3FLT4_COMPH Signal
#define XBAR_FLG14_SD3FLT4_COMPL        0x80U         // Input Flag for SD3FLT4_COMPL Signal
#define XBAR_FLG14_SD4FLT1_COMPH        0x100U        // Input Flag for SD4FLT1_COMPH Signal
#define XBAR_FLG14_SD4FLT1_COMPL        0x200U        // Input Flag for SD4FLT1_COMPL Signal
#define XBAR_FLG14_SD4FLT2_COMPH        0x400U        // Input Flag for SD4FLT2_COMPH Signal
#define XBAR_FLG14_SD4FLT2_COMPL        0x800U        // Input Flag for SD4FLT2_COMPL Signal
#define XBAR_FLG14_SD4FLT3_COMPH        0x1000U       // Input Flag for SD4FLT3_COMPH Signal
#define XBAR_FLG14_SD4FLT3_COMPL        0x2000U       // Input Flag for SD4FLT3_COMPL Signal
#define XBAR_FLG14_SD4FLT4_COMPH        0x4000U       // Input Flag for SD4FLT4_COMPH Signal
#define XBAR_FLG14_SD4FLT4_COMPL        0x8000U       // Input Flag for SD4FLT4_COMPL Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT10   0x20000U      // Input Flag for INPUTXBAR2_INPUT10 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT11   0x40000U      // Input Flag for INPUTXBAR2_INPUT11 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT12   0x80000U      // Input Flag for INPUTXBAR2_INPUT12 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT13   0x100000U     // Input Flag for INPUTXBAR2_INPUT13 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT14   0x200000U     // Input Flag for INPUTXBAR2_INPUT14 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT7    0x400000U     // Input Flag for INPUTXBAR2_INPUT7 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT8    0x800000U     // Input Flag for INPUTXBAR2_INPUT8 Signal
#define XBAR_FLG14_INPUTXBAR2_INPUT9    0x1000000U    // Input Flag for INPUTXBAR2_INPUT9 Signal
#define XBAR_FLG14_MCANB_FEVT0          0x2000000U    // Input Flag for MCANB_FEVT0 Signal
#define XBAR_FLG14_MCANB_FEVT1          0x4000000U    // Input Flag for MCANB_FEVT1 Signal
#define XBAR_FLG14_MCANB_FEVT2          0x8000000U    // Input Flag for MCANB_FEVT2 Signal
#define XBAR_FLG14_FSIA_RX_TRIG1        0x10000000U   // Input Flag for FSIA_RX_TRIG1 Signal
#define XBAR_FLG14_FSIB_RX_TRIG1        0x20000000U   // Input Flag for FSIB_RX_TRIG1 Signal
#define XBAR_FLG14_FSIC_RX_TRIG1        0x40000000U   // Input Flag for FSIC_RX_TRIG1 Signal
#define XBAR_FLG14_FSID_RX_TRIG1        0x80000000U   // Input Flag for FSID_RX_TRIG1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG15 register
//
//*************************************************************************************************
#define XBAR_FLG15_FSIRXA_TRIG_2       0x1U          // Input Flag for FSIRXA_TRIG_2 Signal
#define XBAR_FLG15_FSIRXA_TRIG_3       0x2U          // Input Flag for FSIRXA_TRIG_3 Signal
#define XBAR_FLG15_FSIRXB_TRIG_2       0x4U          // Input Flag for FSIRXB_TRIG_2 Signal
#define XBAR_FLG15_FSIRXB_TRIG_3       0x8U          // Input Flag for FSIRXB_TRIG_3 Signal
#define XBAR_FLG15_FSIRXC_TRIG_2       0x10U         // Input Flag for FSIRXC_TRIG_2 Signal
#define XBAR_FLG15_FSIRXC_TRIG_3       0x20U         // Input Flag for FSIRXC_TRIG_3 Signal
#define XBAR_FLG15_FSIRXD_TRIG_2       0x40U         // Input Flag for FSIRXD_TRIG_2 Signal
#define XBAR_FLG15_FSIRXD_TRIG_3       0x80U         // Input Flag for FSIRXD_TRIG_3 Signal
#define XBAR_FLG15_ECAP1_TRIPOUT       0x100U        // Input Flag for ECAP1_TRIPOUT Signal
#define XBAR_FLG15_ECAP2_TRIPOUT       0x200U        // Input Flag for ECAP2_TRIPOUT Signal
#define XBAR_FLG15_ECAP3_TRIPOUT       0x400U        // Input Flag for ECAP3_TRIPOUT Signal
#define XBAR_FLG15_ECAP4_TRIPOUT       0x800U        // Input Flag for ECAP4_TRIPOUT Signal
#define XBAR_FLG15_ECAP5_TRIPOUT       0x1000U       // Input Flag for ECAP5_TRIPOUT Signal
#define XBAR_FLG15_ECAP6_TRIPOUT       0x2000U       // Input Flag for ECAP6_TRIPOUT Signal
#define XBAR_FLG15_CPU1ERADEVT10       0x4000U       // Input Flag for CPU1ERADEVT10 Signal
#define XBAR_FLG15_CPU1ERADEVT11       0x8000U       // Input Flag for CPU1ERADEVT11 Signal
#define XBAR_FLG15_CPU1ERADEVT8        0x10000U      // Input Flag for CPU1ERADEVT8 Signal
#define XBAR_FLG15_CPU1ERADEVT9        0x20000U      // Input Flag for CPU1ERADEVT9 Signal
#define XBAR_FLG15_CPU1_ADCCHECKEVT1   0x40000U      // Input Flag for CPU1_ADCCHECKEVT1 Signal
#define XBAR_FLG15_CPU1_ADCCHECKEVT2   0x80000U      // Input Flag for CPU1_ADCCHECKEVT2 Signal
#define XBAR_FLG15_CPU1_ADCCHECKEVT3   0x100000U     // Input Flag for CPU1_ADCCHECKEVT3 Signal
#define XBAR_FLG15_CPU1_ADCCHECKEVT4   0x200000U     // Input Flag for CPU1_ADCCHECKEVT4 Signal
#define XBAR_FLG15_CPU2ERADEVT10       0x400000U     // Input Flag for CPU2ERADEVT10 Signal
#define XBAR_FLG15_CPU2ERADEVT11       0x800000U     // Input Flag for CPU2ERADEVT11 Signal
#define XBAR_FLG15_CPU2ERADEVT8        0x1000000U    // Input Flag for CPU2ERADEVT8 Signal
#define XBAR_FLG15_CPU2ERADEVT9        0x2000000U    // Input Flag for CPU2ERADEVT9 Signal
#define XBAR_FLG15_CPU2_ADCCHECKEVT1   0x4000000U    // Input Flag for CPU2_ADCCHECKEVT1 Signal
#define XBAR_FLG15_CPU2_ADCCHECKEVT2   0x8000000U    // Input Flag for CPU2_ADCCHECKEVT2 Signal
#define XBAR_FLG15_CPU2_ADCCHECKEVT3   0x10000000U   // Input Flag for CPU2_ADCCHECKEVT3 Signal
#define XBAR_FLG15_CPU2_ADCCHECKEVT4   0x20000000U   // Input Flag for CPU2_ADCCHECKEVT4 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG16 register
//
//*************************************************************************************************
#define XBAR_FLG16_CMPSS9_CTRIPH       0x1U          // Input Flag for CMPSS9_CTRIPH Signal
#define XBAR_FLG16_CMPSS9_CTRIPL       0x2U          // Input Flag for CMPSS9_CTRIPL Signal
#define XBAR_FLG16_CMPSS9_CTRIPOUTH    0x4U          // Input Flag for CMPSS9_CTRIPOUTH Signal
#define XBAR_FLG16_CMPSS9_CTRIPOUTL    0x8U          // Input Flag for CMPSS9_CTRIPOUTL Signal
#define XBAR_FLG16_CMPSS10_CTRIPH      0x10U         // Input Flag for CMPSS10_CTRIPH Signal
#define XBAR_FLG16_CMPSS10_CTRIPL      0x20U         // Input Flag for CMPSS10_CTRIPL Signal
#define XBAR_FLG16_CMPSS10_CTRIPOUTH   0x40U         // Input Flag for CMPSS10_CTRIPOUTH Signal
#define XBAR_FLG16_CMPSS10_CTRIPOUTL   0x80U         // Input Flag for CMPSS10_CTRIPOUTL Signal
#define XBAR_FLG16_CMPSS11_CTRIPH      0x100U        // Input Flag for CMPSS11_CTRIPH Signal
#define XBAR_FLG16_CMPSS11_CTRIPL      0x200U        // Input Flag for CMPSS11_CTRIPL Signal
#define XBAR_FLG16_CMPSS11_CTRIPOUTH   0x400U        // Input Flag for CMPSS11_CTRIPOUTH Signal
#define XBAR_FLG16_CMPSS11_CTRIPOUTL   0x800U        // Input Flag for CMPSS11_CTRIPOUTL Signal
#define XBAR_FLG16_CMPSS12_CTRIPH      0x1000U       // Input Flag for CMPSS12_CTRIPH Signal
#define XBAR_FLG16_CMPSS12_CTRIPL      0x2000U       // Input Flag for CMPSS12_CTRIPL Signal
#define XBAR_FLG16_CMPSS12_CTRIPOUTH   0x4000U       // Input Flag for CMPSS12_CTRIPOUTH Signal
#define XBAR_FLG16_CMPSS12_CTRIPOUTL   0x8000U       // Input Flag for CMPSS12_CTRIPOUTL Signal
#define XBAR_FLG16_XCLKOUT             0x80000000U   // Input Flag for XCLKOUT Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR1 register
//
//*************************************************************************************************
#define XBAR_CLR1_CMPSS1_CTRIPL      0x1U          // Input Flag Clear for CMPSS1.CTRIPL Signal
#define XBAR_CLR1_CMPSS1_CTRIPH      0x2U          // Input Flag Clear for CMPSS1.CTRIPH Signal
#define XBAR_CLR1_CMPSS2_CTRIPL      0x4U          // Input Flag Clear for CMPSS2.CTRIPL Signal
#define XBAR_CLR1_CMPSS2_CTRIPH      0x8U          // Input Flag Clear for CMPSS2.CTRIPH Signal
#define XBAR_CLR1_CMPSS3_CTRIPL      0x10U         // Input Flag Clear for CMPSS3.CTRIPL Signal
#define XBAR_CLR1_CMPSS3_CTRIPH      0x20U         // Input Flag Clear for CMPSS3.CTRIPH Signal
#define XBAR_CLR1_CMPSS4_CTRIPL      0x40U         // Input Flag Clear for CMPSS4.CTRIPL Signal
#define XBAR_CLR1_CMPSS4_CTRIPH      0x80U         // Input Flag Clear for CMPSS4.CTRIPH Signal
#define XBAR_CLR1_CMPSS5_CTRIPL      0x100U        // Input Flag Clear for CMPSS5.CTRIPL Signal
#define XBAR_CLR1_CMPSS5_CTRIPH      0x200U        // Input Flag Clear for CMPSS5.CTRIPH Signal
#define XBAR_CLR1_CMPSS6_CTRIPL      0x400U        // Input Flag Clear for CMPSS6.CTRIPL Signal
#define XBAR_CLR1_CMPSS6_CTRIPH      0x800U        // Input Flag Clear for CMPSS6.CTRIPH Signal
#define XBAR_CLR1_CMPSS7_CTRIPL      0x1000U       // Input Flag Clear for CMPSS7.CTRIPL Signal
#define XBAR_CLR1_CMPSS7_CTRIPH      0x2000U       // Input Flag Clear for CMPSS7.CTRIPH Signal
#define XBAR_CLR1_CMPSS8_CTRIPL      0x4000U       // Input Flag Clear for CMPSS8.CTRIPL Signal
#define XBAR_CLR1_CMPSS8_CTRIPH      0x8000U       // Input Flag Clear for CMPSS8.CTRIPH Signal
#define XBAR_CLR1_CMPSS1_CTRIPOUTL   0x10000U      // Input Flag Clear for CMPSS1.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS1_CTRIPOUTH   0x20000U      // Input Flag Clear for CMPSS1.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS2_CTRIPOUTL   0x40000U      // Input Flag Clear for CMPSS2.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS2_CTRIPOUTH   0x80000U      // Input Flag Clear for CMPSS2.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS3_CTRIPOUTL   0x100000U     // Input Flag Clear for CMPSS3.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS3_CTRIPOUTH   0x200000U     // Input Flag Clear for CMPSS3.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS4_CTRIPOUTL   0x400000U     // Input Flag Clear for CMPSS4.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS4_CTRIPOUTH   0x800000U     // Input Flag Clear for CMPSS4.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS5_CTRIPOUTL   0x1000000U    // Input Flag Clear for CMPSS5.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS5_CTRIPOUTH   0x2000000U    // Input Flag Clear for CMPSS5.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS6_CTRIPOUTL   0x4000000U    // Input Flag Clear for CMPSS6.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS6_CTRIPOUTH   0x8000000U    // Input Flag Clear for CMPSS6.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS7_CTRIPOUTL   0x10000000U   // Input Flag Clear for CMPSS7.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS7_CTRIPOUTH   0x20000000U   // Input Flag Clear for CMPSS7.CTRIPOUTH Signal
#define XBAR_CLR1_CMPSS8_CTRIPOUTL   0x40000000U   // Input Flag Clear for CMPSS8.CTRIPOUTL Signal
#define XBAR_CLR1_CMPSS8_CTRIPOUTH   0x80000000U   // Input Flag Clear for CMPSS8.CTRIPOUTH Signal

