t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR2 register
//
//*************************************************************************************************
#define XBAR_CLR2_INPUT1       0x1U          // Input Flag Clear for INPUT1 Signal
#define XBAR_CLR2_INPUT2       0x2U          // Input Flag Clear for INPUT2 Signal
#define XBAR_CLR2_INPUT3       0x4U          // Input Flag Clear for INPUT3 Signal
#define XBAR_CLR2_INPUT4       0x8U          // Input Flag Clear for INPUT4 Signal
#define XBAR_CLR2_INPUT5       0x10U         // Input Flag Clear for INPUT5 Signal
#define XBAR_CLR2_INPUT6       0x20U         // Input Flag Clear for INPUT6 Signal
#define XBAR_CLR2_ADCSOCA      0x40U         // Input Flag Clear for ADCSOCA Signal
#define XBAR_CLR2_ADCSOCB      0x80U         // Input Flag Clear for ADCSOCB Signal
#define XBAR_CLR2_INPUT7       0x100U        // Input Flag Clear for INPUT7 Signal
#define XBAR_CLR2_INPUT8       0x200U        // Input Flag Clear for INPUT8 Signal
#define XBAR_CLR2_INPUT9       0x400U        // Input Flag Clear for INPUT9 Signal
#define XBAR_CLR2_INPUT10      0x800U        // Input Flag Clear for INPUT10 Signal
#define XBAR_CLR2_INPUT11      0x1000U       // Input Flag Clear for INPUT11 Signal
#define XBAR_CLR2_INPUT12      0x2000U       // Input Flag Clear for INPUT12 Signal
#define XBAR_CLR2_INPUT13      0x4000U       // Input Flag Clear for INPUT13 Signal
#define XBAR_CLR2_INPUT14      0x8000U       // Input Flag Clear for INPUT14 Signal
#define XBAR_CLR2_ECAP1_OUT    0x10000U      // Input Flag Clear for ECAP1.OUT Signal
#define XBAR_CLR2_ECAP2_OUT    0x20000U      // Input Flag Clear for ECAP2.OUT Signal
#define XBAR_CLR2_ECAP3_OUT    0x40000U      // Input Flag Clear for ECAP3.OUT Signal
#define XBAR_CLR2_ECAP4_OUT    0x80000U      // Input Flag Clear for ECAP4.OUT Signal
#define XBAR_CLR2_ECAP5_OUT    0x100000U     // Input Flag Clear for ECAP5.OUT Signal
#define XBAR_CLR2_ECAP6_OUT    0x200000U     // Input Flag Clear for ECAP6.OUT Signal
#define XBAR_CLR2_EXTSYNCOUT   0x400000U     // Input Flag Clear for EXTSYNCOUT Signal
#define XBAR_CLR2_ADCAEVT1     0x800000U     // Input Flag Clear for ADCAEVT1 Signal
#define XBAR_CLR2_ADCAEVT2     0x1000000U    // Input Flag Clear for ADCAEVT2 Signal
#define XBAR_CLR2_ADCAEVT3     0x2000000U    // Input Flag Clear for ADCAEVT3 Signal
#define XBAR_CLR2_ADCAEVT4     0x4000000U    // Input Flag Clear for ADCAEVT4 Signal
#define XBAR_CLR2_ADCBEVT1     0x8000000U    // Input Flag Clear for ADCBEVT1 Signal
#define XBAR_CLR2_ADCBEVT2     0x10000000U   // Input Flag Clear for ADCBEVT2 Signal
#define XBAR_CLR2_ADCBEVT3     0x20000000U   // Input Flag Clear for ADCBEVT3 Signal
#define XBAR_CLR2_ADCBEVT4     0x40000000U   // Input Flag Clear for ADCBEVT4 Signal
#define XBAR_CLR2_ADCCEVT1     0x80000000U   // Input Flag Clear for ADCCEVT1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR3 register
//
//*************************************************************************************************
#define XBAR_CLR3_ADCCEVT2        0x1U        // Input Flag Clear for ADCCEVT2 Signal
#define XBAR_CLR3_ADCCEVT3        0x2U        // Input Flag Clear for ADCCEVT3 Signal
#define XBAR_CLR3_ADCCEVT4        0x4U        // Input Flag Clear for ADCCEVT4 Signal
#define XBAR_CLR3_SD1FLT1_COMPL   0x80U       // Input Flag Clear for SD1FLT1.COMPL Signal
#define XBAR_CLR3_SD1FLT1_COMPH   0x100U      // Input Flag Clear for SD1FLT1.COMPH Signal
#define XBAR_CLR3_SD1FLT2_COMPL   0x200U      // Input Flag Clear for SD1FLT2.COMPL Signal
#define XBAR_CLR3_SD1FLT2_COMPH   0x400U      // Input Flag Clear for SD1FLT2.COMPH Signal
#define XBAR_CLR3_SD1FLT3_COMPL   0x800U      // Input Flag Clear for SD1FLT3.COMPL Signal
#define XBAR_CLR3_SD1FLT3_COMPH   0x1000U     // Input Flag Clear for SD1FLT3.COMPH Signal
#define XBAR_CLR3_SD1FLT4_COMPL   0x2000U     // Input Flag Clear for SD1FLT4.COMPL Signal
#define XBAR_CLR3_SD1FLT4_COMPH   0x4000U     // Input Flag Clear for SD1FLT4.COMPH Signal
#define XBAR_CLR3_SD2FLT1_COMPL   0x8000U     // Input Flag Clear for SD2FLT1.COMPL Signal
#define XBAR_CLR3_SD2FLT1_COMPH   0x10000U    // Input Flag Clear for SD2FLT1.COMPH Signal
#define XBAR_CLR3_SD2FLT2_COMPL   0x20000U    // Input Flag Clear for SD2FLT2.COMPL Signal
#define XBAR_CLR3_SD2FLT2_COMPH   0x40000U    // Input Flag Clear for SD2FLT2.COMPH Signal
#define XBAR_CLR3_SD2FLT3_COMPL   0x80000U    // Input Flag Clear for SD2FLT3.COMPL Signal
#define XBAR_CLR3_SD2FLT3_COMPH   0x100000U   // Input Flag Clear for SD2FLT3.COMPH Signal
#define XBAR_CLR3_SD2FLT4_COMPL   0x200000U   // Input Flag Clear for SD2FLT4.COMPL Signal
#define XBAR_CLR3_SD2FLT4_COMPH   0x400000U   // Input Flag Clear for SD2FLT4.COMPH Signal
#define XBAR_CLR3_ECAP7_OUT       0x800000U   // Input Flag clear for ECAP7.OUT Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR4 register
//
//*************************************************************************************************
#define XBAR_CLR4_MCANA_FEVT0      0x200U        // Input Flag clear for MCANA_FEVT0 Signal
#define XBAR_CLR4_MCANA_FEVT1      0x400U        // Input Flag clear for MCANA_FEVT1 Signal
#define XBAR_CLR4_MCANA_FEVT2      0x800U        // Input Flag clear for MCANA_FEVT2 Signal
#define XBAR_CLR4_CLB1_OUT4        0x10000U      // Input Flag clear for CLB1_4.1 Signal
#define XBAR_CLR4_CLB1_OUT5        0x20000U      // Input Flag clear for CLB1_5.1 Signal
#define XBAR_CLR4_CLB2_OUT4        0x40000U      // Input Flag clear for CLB2_4.1 Signal
#define XBAR_CLR4_CLB2_OUT5        0x80000U      // Input Flag clear for CLB2_5.1 Signal
#define XBAR_CLR4_CLB3_OUT4        0x100000U     // Input Flag clear for CLB3_4.1 Signal
#define XBAR_CLR4_CLB3_OUT5        0x200000U     // Input Flag clear for CLB3_5.1 Signal
#define XBAR_CLR4_CLB4_OUT4        0x400000U     // Input Flag clear for CLB4_4.1 Signal
#define XBAR_CLR4_CLB4_OUT5        0x800000U     // Input Flag clear for CLB4_5.1 Signal
#define XBAR_CLR4_CLB5_OUT4        0x1000000U    // Input Latch clear for CLB5_OUT4 Signal
#define XBAR_CLR4_CLB5_OUT5        0x2000000U    // Input Latch clear for CLB5_OUT5 Signal
#define XBAR_CLR4_CLB6_OUT4        0x4000000U    // Input Latch clear for CLB6_OUT4 Signal
#define XBAR_CLR4_CLB6_OUT5        0x8000000U    // Input Latch clear for CLB6_OUT5 Signal
#define XBAR_CLR4_ERRORSTS_ERROR   0x10000000U   // Input Latch clear for ERRORSTS_ERROR Signal
#define XBAR_CLR4_ECATSYNC0        0x20000000U   // Input Latch clear for ECATSYNC0 Signal
#define XBAR_CLR4_ECATSYNC1        0x40000000U   // Input Latch clear for ECATSYNC1 Signal
#define XBAR_CLR4_CLAHALT          0x80000000U   // Input Flag clear for CLAHALT Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR5 register
//
//*************************************************************************************************
#define XBAR_CLR5_EPWM1_TRIPOUT    0x1U       // Input Flag clear for EPWM1_TRIPOUT Signal
#define XBAR_CLR5_EPWM2_TRIPOUT    0x2U       // Input Flag clear for EPWM2_TRIPOUT Signal
#define XBAR_CLR5_EPWM3_TRIPOUT    0x4U       // Input Flag clear for EPWM3_TRIPOUT Signal
#define XBAR_CLR5_EPWM4_TRIPOUT    0x8U       // Input Flag clear for EPWM4_TRIPOUT Signal
#define XBAR_CLR5_EPWM5_TRIPOUT    0x10U      // Input Flag clear for EPWM5_TRIPOUT Signal
#define XBAR_CLR5_EPWM6_TRIPOUT    0x20U      // Input Flag clear for EPWM6_TRIPOUT Signal
#define XBAR_CLR5_EPWM7_TRIPOUT    0x40U      // Input Flag clear for EPWM7_TRIPOUT Signal
#define XBAR_CLR5_EPWM8_TRIPOUT    0x80U      // Input Flag clear for EPWM8_TRIPOUT Signal
#define XBAR_CLR5_EPWM9_TRIPOUT    0x100U     // Input Flag clear for EPWM9_TRIPOUT Signal
#define XBAR_CLR5_EPWM10_TRIPOUT   0x200U     // Input Flag clear for EPWM10_TRIPOUT Signal
#define XBAR_CLR5_EPWM11_TRIPOUT   0x400U     // Input Flag clear for EPWM11_TRIPOUT Signal
#define XBAR_CLR5_EPWM12_TRIPOUT   0x800U     // Input Flag clear for EPWM12_TRIPOUT Signal
#define XBAR_CLR5_EPWM13_TRIPOUT   0x1000U    // Input Flag clear for EPWM13_TRIPOUT Signal
#define XBAR_CLR5_EPWM14_TRIPOUT   0x2000U    // Input Flag clear for EPWM14_TRIPOUT Signal
#define XBAR_CLR5_EPWM15_TRIPOUT   0x4000U    // Input Flag clear for EPWM15_TRIPOUT Signal
#define XBAR_CLR5_EPWM16_TRIPOUT   0x8000U    // Input Flag clear for EPWM16_TRIPOUT Signal
#define XBAR_CLR5_EPWM17_TRIPOUT   0x10000U   // Input Flag clear for EPWM17_TRIPOUT Signal
#define XBAR_CLR5_EPWM18_TRIPOUT   0x20000U   // Input Flag clear for EPWM18_TRIPOUT Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR6 register
//
//*************************************************************************************************
#define XBAR_CLR6_EPWM1_DEL_TRIP    0x1U       // Input Flag clear for EPWM1_DEL_TRIP Signal
#define XBAR_CLR6_EPWM2_DEL_TRIP    0x2U       // Input Flag clear for EPWM2_DEL_TRIP Signal
#define XBAR_CLR6_EPWM3_DEL_TRIP    0x4U       // Input Flag clear for EPWM3_DEL_TRIP Signal
#define XBAR_CLR6_EPWM4_DEL_TRIP    0x8U       // Input Flag clear for EPWM4_DEL_TRIP Signal
#define XBAR_CLR6_EPWM5_DEL_TRIP    0x10U      // Input Flag clear for EPWM5_DEL_TRIP Signal
#define XBAR_CLR6_EPWM6_DEL_TRIP    0x20U      // Input Flag clear for EPWM6_DEL_TRIP Signal
#define XBAR_CLR6_EPWM7_DEL_TRIP    0x40U      // Input Flag clear for EPWM7_DEL_TRIP Signal
#define XBAR_CLR6_EPWM8_DEL_TRIP    0x80U      // Input Flag clear for EPWM8_DEL_TRIP Signal
#define XBAR_CLR6_EPWM9_DEL_TRIP    0x100U     // Input Flag clear for EPWM9_DEL_TRIP Signal
#define XBAR_CLR6_EPWM10_DEL_TRIP   0x200U     // Input Flag clear for EPWM10_DEL_TRIP Signal
#define XBAR_CLR6_EPWM11_DEL_TRIP   0x400U     // Input Flag clear for EPWM11_DEL_TRIP Signal
#define XBAR_CLR6_EPWM12_DEL_TRIP   0x800U     // Input Flag clear for EPWM12_DEL_TRIP Signal
#define XBAR_CLR6_EPWM13_DEL_TRIP   0x1000U    // Input Flag clear for EPWM13_DEL_TRIP Signal
#define XBAR_CLR6_EPWM14_DEL_TRIP   0x2000U    // Input Flag clear for EPWM14_DEL_TRIP Signal
#define XBAR_CLR6_EPWM15_DEL_TRIP   0x4000U    // Input Flag clear for EPWM15_DEL_TRIP Signal
#define XBAR_CLR6_EPWM16_DEL_TRIP   0x8000U    // Input Flag clear for EPWM16_DEL_TRIP Signal
#define XBAR_CLR6_EPWM17_DEL_TRIP   0x10000U   // Input Flag clear for EPWM17_DEL_TRIP Signal
#define XBAR_CLR6_EPWM18_DEL_TRIP   0x20000U   // Input Flag clear for EPWM18_DEL_TRIP Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR7 register
//
//*************************************************************************************************
#define XBAR_CLR7_EPWM1_DEL_ACTIVE    0x1U       // Input Flag clear for EPWM1_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM2_DEL_ACTIVE    0x2U       // Input Flag clear for EPWM2_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM3_DEL_ACTIVE    0x4U       // Input Flag clear for EPWM3_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM4_DEL_ACTIVE    0x8U       // Input Flag clear for EPWM4_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM5_DEL_ACTIVE    0x10U      // Input Flag clear for EPWM5_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM6_DEL_ACTIVE    0x20U      // Input Flag clear for EPWM6_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM7_DEL_ACTIVE    0x40U      // Input Flag clear for EPWM7_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM8_DEL_ACTIVE    0x80U      // Input Flag clear for EPWM8_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM9_DEL_ACTIVE    0x100U     // Input Flag clear for EPWM9_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM10_DEL_ACTIVE   0x200U     // Input Flag clear for EPWM10_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM11_DEL_ACTIVE   0x400U     // Input Flag clear for EPWM11_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM12_DEL_ACTIVE   0x800U     // Input Flag clear for EPWM12_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM13_DEL_ACTIVE   0x1000U    // Input Flag clear for EPWM13_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM14_DEL_ACTIVE   0x2000U    // Input Flag clear for EPWM14_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM15_DEL_ACTIVE   0x4000U    // Input Flag clear for EPWM15_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM16_DEL_ACTIVE   0x8000U    // Input Flag clear for EPWM16_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM17_DEL_ACTIVE   0x10000U   // Input Flag clear for EPWM17_DEL_ACTIVE Signal
#define XBAR_CLR7_EPWM18_DEL_ACTIVE   0x20000U   // Input Flag clear for EPWM18_DEL_ACTIVE Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR8 register
//
//*************************************************************************************************
#define XBAR_CLR8_ETPWM1_A0_SCLK    0x1U          // Input Flag clear for ETPWM1_A0_sclk Signal
#define XBAR_CLR8_ETPWM1_B0_SCLK    0x2U          // Input Flag clear for ETPWM1_B0_sclk Signal
#define XBAR_CLR8_ETPWM2_A0_SCLK    0x4U          // Input Flag clear for ETPWM2_A0_sclk Signal
#define XBAR_CLR8_ETPWM2_B0_SCLK    0x8U          // Input Flag clear for ETPWM2_B0_sclk Signal
#define XBAR_CLR8_ETPWM3_A0_SCLK    0x10U         // Input Flag clear for ETPWM3_A0_sclk Signal
#define XBAR_CLR8_ETPWM3_B0_SCLK    0x20U         // Input Flag clear for ETPWM3_B0_sclk Signal
#define XBAR_CLR8_ETPWM4_A0_SCLK    0x40U         // Input Flag clear for ETPWM4_A0_sclk Signal
#define XBAR_CLR8_ETPWM4_B0_SCLK    0x80U         // Input Flag clear for ETPWM4_B0_sclk Signal
#define XBAR_CLR8_ETPWM5_A0_SCLK    0x100U        // Input Flag clear for ETPWM5_A0_sclk Signal
#define XBAR_CLR8_ETPWM5_B0_SCLK    0x200U        // Input Flag clear for ETPWM5_B0_sclk Signal
#define XBAR_CLR8_ETPWM6_A0_SCLK    0x400U        // Input Flag clear for ETPWM6_A0_sclk Signal
#define XBAR_CLR8_ETPWM6_B0_SCLK    0x800U        // Input Flag clear for ETPWM6_B0_sclk Signal
#define XBAR_CLR8_ETPWM7_A0_SCLK    0x1000U       // Input Flag clear for ETPWM7_A0_sclk Signal
#define XBAR_CLR8_ETPWM7_B0_SCLK    0x2000U       // Input Flag clear for ETPWM7_B0_sclk Signal
#define XBAR_CLR8_ETPWM8_A0_SCLK    0x4000U       // Input Flag clear for ETPWM8_A0_sclk Signal
#define XBAR_CLR8_ETPWM8_B0_SCLK    0x8000U       // Input Flag clear for ETPWM8_B0_sclk Signal
#define XBAR_CLR8_ETPWM9_A0_SCLK    0x10000U      // Input Flag clear for ETPWM9_A0_sclk Signal
#define XBAR_CLR8_ETPWM9_B0_SCLK    0x20000U      // Input Flag clear for ETPWM9_B0_sclk Signal
#define XBAR_CLR8_ETPWM10_A0_SCLK   0x40000U      // Input Flag clear for ETPWM10_A0_sclk Signal
#define XBAR_CLR8_ETPWM10_B0_SCLK   0x80000U      // Input Flag clear for ETPWM10_B0_sclk Signal
#define XBAR_CLR8_ETPWM11_A0_SCLK   0x100000U     // Input Flag clear for ETPWM11_A0_sclk Signal
#define XBAR_CLR8_ETPWM11_B0_SCLK   0x200000U     // Input Flag clear for ETPWM11_B0_sclk Signal
#define XBAR_CLR8_ETPWM12_A0_SCLK   0x400000U     // Input Flag clear for ETPWM12_A0_sclk Signal
#define XBAR_CLR8_ETPWM12_B0_SCLK   0x800000U     // Input Flag clear for ETPWM12_B0_sclk Signal
#define XBAR_CLR8_ETPWM13_A0_SCLK   0x1000000U    // Input Flag clear for ETPWM13_A0_sclk Signal
#define XBAR_CLR8_ETPWM13_B0_SCLK   0x2000000U    // Input Flag clear for ETPWM13_B0_sclk Signal
#define XBAR_CLR8_ETPWM14_A0_SCLK   0x4000000U    // Input Flag clear for ETPWM14_A0_sclk Signal
#define XBAR_CLR8_ETPWM14_B0_SCLK   0x8000000U    // Input Flag clear for ETPWM14_B0_sclk Signal
#define XBAR_CLR8_ETPWM15_A0_SCLK   0x10000000U   // Input Flag clear for ETPWM15_A0_sclk Signal
#define XBAR_CLR8_ETPWM15_B0_SCLK   0x20000000U   // Input Flag clear for ETPWM15_B0_sclk Signal
#define XBAR_CLR8_ETPWM16_A0_SCLK   0x40000000U   // Input Flag clear for ETPWM16_A0_sclk Signal
#define XBAR_CLR8_ETPWM16_B0_SCLK   0x80000000U   // Input Flag clear for ETPWM16_B0_sclk Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR9 register
//
//*************************************************************************************************
#define XBAR_CLR9_ETPWM17_A0_SCLK   0x1U   // Input Flag clear for ETPWM17_A0_sclk Signal
#define XBAR_CLR9_ETPWM17_B0_SCLK   0x2U   // Input Flag clear for ETPWM17_B0_sclk Signal
#define XBAR_CLR9_ETPWM18_A0_SCLK   0x4U   // Input Flag clear for ETPWM18_A0_sclk Signal
#define XBAR_CLR9_ETPWM18_B0_SCLK   0x8U   // Input Flag clear for ETPWM18_B0_sclk Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR10 register
//
//*************************************************************************************************
#define XBAR_CLR10_MDL1_OUTA    0x1U          // Input Flag clear for MDL1_OUTA Signal
#define XBAR_CLR10_MDL1_OUTB    0x2U          // Input Flag clear for MDL1_OUTB Signal
#define XBAR_CLR10_MDL2_OUTA    0x4U          // Input Flag clear for MDL2_OUTA Signal
#define XBAR_CLR10_MDL2_OUTB    0x8U          // Input Flag clear for MDL2_OUTB Signal
#define XBAR_CLR10_MDL3_OUTA    0x10U         // Input Flag clear for MDL3_OUTA Signal
#define XBAR_CLR10_MDL3_OUTB    0x20U         // Input Flag clear for MDL3_OUTB Signal
#define XBAR_CLR10_MDL4_OUTA    0x40U         // Input Flag clear for MDL4_OUTA Signal
#define XBAR_CLR10_MDL4_OUTB    0x80U         // Input Flag clear for MDL4_OUTB Signal
#define XBAR_CLR10_MDL5_OUTA    0x100U        // Input Flag clear for MDL5_OUTA Signal
#define XBAR_CLR10_MDL5_OUTB    0x200U        // Input Flag clear for MDL5_OUTB Signal
#define XBAR_CLR10_MDL6_OUTA    0x400U        // Input Flag clear for MDL6_OUTA Signal
#define XBAR_CLR10_MDL6_OUTB    0x800U        // Input Flag clear for MDL6_OUTB Signal
#define XBAR_CLR10_MDL7_OUTA    0x1000U       // Input Flag clear for MDL7_OUTA Signal
#define XBAR_CLR10_MDL7_OUTB    0x2000U       // Input Flag clear for MDL7_OUTB Signal
#define XBAR_CLR10_MDL8_OUTA    0x4000U       // Input Flag clear for MDL8_OUTA Signal
#define XBAR_CLR10_MDL8_OUTB    0x8000U       // Input Flag clear for MDL8_OUTB Signal
#define XBAR_CLR10_MDL9_OUTA    0x10000U      // Input Flag clear for MDL9_OUTA Signal
#define XBAR_CLR10_MDL9_OUTB    0x20000U      // Input Flag clear for MDL9_OUTB Signal
#define XBAR_CLR10_MDL10_OUTA   0x40000U      // Input Flag clear for MDL10_OUTA Signal
#define XBAR_CLR10_MDL10_OUTB   0x80000U      // Input Flag clear for MDL10_OUTB Signal
#define XBAR_CLR10_MDL11_OUTA   0x100000U     // Input Flag clear for MDL11_OUTA Signal
#define XBAR_CLR10_MDL11_OUTB   0x200000U     // Input Flag clear for MDL11_OUTB Signal
#define XBAR_CLR10_MDL12_OUTA   0x400000U     // Input Flag clear for MDL12_OUTA Signal
#define XBAR_CLR10_MDL12_OUTB   0x800000U     // Input Flag clear for MDL12_OUTB Signal
#define XBAR_CLR10_MDL13_OUTA   0x1000000U    // Input Flag clear for MDL13_OUTA Signal
#define XBAR_CLR10_MDL13_OUTB   0x2000000U    // Input Flag clear for MDL13_OUTB Signal
#define XBAR_CLR10_MDL14_OUTA   0x4000000U    // Input Flag clear for MDL14_OUTA Signal
#define XBAR_CLR10_MDL14_OUTB   0x8000000U    // Input Flag clear for MDL14_OUTB Signal
#define XBAR_CLR10_MDL15_OUTA   0x10000000U   // Input Flag clear for MDL15_OUTA Signal
#define XBAR_CLR10_MDL15_OUTB   0x20000000U   // Input Flag clear for MDL15_OUTB Signal
#define XBAR_CLR10_MDL16_OUTA   0x40000000U   // Input Flag clear for MDL16_OUTA Signal
#define XBAR_CLR10_MDL16_OUTB   0x80000000U   // Input Flag clear for MDL16_OUTB Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR11 register
//
//*************************************************************************************************
#define XBAR_CLR11_MDL17_OUTA   0x1U   // Input Flag clear for MDL17_OUTA Signal
#define XBAR_CLR11_MDL17_OUTB   0x2U   // Input Flag clear for MDL17_OUTB Signal
#define XBAR_CLR11_MDL18_OUTA   0x4U   // Input Flag clear for MDL18_OUTA Signal
#define XBAR_CLR11_MDL18_OUTB   0x8U   // Input Flag clear for MDL18_OUTB Signal

