t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR12 register
//
//*************************************************************************************************
#define XBAR_CLR12_CLB1_OUT0   0x1U          // Input Flag clear for CLB1_OUT0 Signal
#define XBAR_CLR12_CLB1_OUT1   0x2U          // Input Flag clear for CLB1_OUT1 Signal
#define XBAR_CLR12_CLB1_OUT2   0x4U          // Input Flag clear for CLB1_OUT2 Signal
#define XBAR_CLR12_CLB1_OUT3   0x8U          // Input Flag clear for CLB1_OUT3 Signal
#define XBAR_CLR12_CLB1_OUT6   0x10U         // Input Flag clear for CLB1_OUT6 Signal
#define XBAR_CLR12_CLB1_OUT7   0x20U         // Input Flag clear for CLB1_OUT7 Signal
#define XBAR_CLR12_CLB2_OUT0   0x40U         // Input Flag clear for CLB2_OUT0 Signal
#define XBAR_CLR12_CLB2_OUT1   0x80U         // Input Flag clear for CLB2_OUT1 Signal
#define XBAR_CLR12_CLB2_OUT2   0x100U        // Input Flag clear for CLB2_OUT2 Signal
#define XBAR_CLR12_CLB2_OUT3   0x200U        // Input Flag clear for CLB2_OUT3 Signal
#define XBAR_CLR12_CLB2_OUT6   0x400U        // Input Flag clear for CLB2_OUT6 Signal
#define XBAR_CLR12_CLB2_OUT7   0x800U        // Input Flag clear for CLB2_OUT7 Signal
#define XBAR_CLR12_CLB3_OUT0   0x1000U       // Input Flag clear for CLB3_OUT0 Signal
#define XBAR_CLR12_CLB3_OUT1   0x2000U       // Input Flag clear for CLB3_OUT1 Signal
#define XBAR_CLR12_CLB3_OUT2   0x4000U       // Input Flag clear for CLB3_OUT2 Signal
#define XBAR_CLR12_CLB3_OUT3   0x8000U       // Input Flag clear for CLB3_OUT3 Signal
#define XBAR_CLR12_CLB3_OUT6   0x10000U      // Input Flag clear for CLB3_OUT6 Signal
#define XBAR_CLR12_CLB3_OUT7   0x20000U      // Input Flag clear for CLB3_OUT7 Signal
#define XBAR_CLR12_CLB4_OUT0   0x40000U      // Input Flag clear for CLB4_OUT0 Signal
#define XBAR_CLR12_CLB4_OUT1   0x80000U      // Input Flag clear for CLB4_OUT1 Signal
#define XBAR_CLR12_CLB4_OUT2   0x100000U     // Input Flag clear for CLB4_OUT2 Signal
#define XBAR_CLR12_CLB4_OUT3   0x200000U     // Input Flag clear for CLB4_OUT3 Signal
#define XBAR_CLR12_CLB4_OUT6   0x400000U     // Input Flag clear for CLB4_OUT6 Signal
#define XBAR_CLR12_CLB4_OUT7   0x800000U     // Input Flag clear for CLB4_OUT7 Signal
#define XBAR_CLR12_CLB5_OUT0   0x1000000U    // Input Flag clear for CLB5_OUT0 Signal
#define XBAR_CLR12_CLB5_OUT1   0x2000000U    // Input Flag clear for CLB5_OUT1 Signal
#define XBAR_CLR12_CLB5_OUT2   0x4000000U    // Input Flag clear for CLB5_OUT2 Signal
#define XBAR_CLR12_CLB5_OUT3   0x8000000U    // Input Flag clear for CLB5_OUT3 Signal
#define XBAR_CLR12_CLB5_OUT6   0x10000000U   // Input Flag clear for CLB5_OUT6 Signal
#define XBAR_CLR12_CLB5_OUT7   0x20000000U   // Input Flag clear for CLB5_OUT7 Signal
#define XBAR_CLR12_CLB6_OUT0   0x40000000U   // Input Flag clear for CLB6_OUT0 Signal
#define XBAR_CLR12_CLB6_OUT1   0x80000000U   // Input Flag clear for CLB6_OUT1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR13 register
//
//*************************************************************************************************
#define XBAR_CLR13_CLB6_OUT2         0x1U          // Input Flag clear for CLB6_OUT2 Signal
#define XBAR_CLR13_CLB6_OUT3         0x2U          // Input Flag clear for CLB6_OUT3 Signal
#define XBAR_CLR13_CLB6_OUT6         0x4U          // Input Flag clear for CLB6_OUT6 Signal
#define XBAR_CLR13_CLB6_OUT7         0x8U          // Input Flag clear for CLB6_OUT7 Signal
#define XBAR_CLR13_XTRIPOUT1         0x10U         // Input Flag clear for XTRIPOUT1 Signal
#define XBAR_CLR13_XTRIPOUT2         0x20U         // Input Flag clear for XTRIPOUT2 Signal
#define XBAR_CLR13_XTRIPOUT3         0x40U         // Input Flag clear for XTRIPOUT3 Signal
#define XBAR_CLR13_XTRIPOUT4         0x80U         // Input Flag clear for XTRIPOUT4 Signal
#define XBAR_CLR13_XTRIPOUT5         0x100U        // Input Flag clear for XTRIPOUT5 Signal
#define XBAR_CLR13_XTRIPOUT6         0x200U        // Input Flag clear for XTRIPOUT6 Signal
#define XBAR_CLR13_XTRIPOUT7         0x400U        // Input Flag clear for XTRIPOUT7 Signal
#define XBAR_CLR13_XTRIPOUT8         0x800U        // Input Flag clear for XTRIPOUT8 Signal
#define XBAR_CLR13_ADCA_EXTMUXSEL0   0x1000U       // Input Flag clear for ADCA_EXTMUXSEL0 Signal
#define XBAR_CLR13_ADCA_EXTMUXSEL1   0x2000U       // Input Flag clear for ADCA_EXTMUXSEL1 Signal
#define XBAR_CLR13_ADCA_EXTMUXSEL2   0x4000U       // Input Flag clear for ADCA_EXTMUXSEL2 Signal
#define XBAR_CLR13_ADCA_EXTMUXSEL3   0x8000U       // Input Flag clear for ADCA_EXTMUXSEL3 Signal
#define XBAR_CLR13_ADCB_EXTMUXSEL0   0x10000U      // Input Flag clear for ADCB_EXTMUXSEL0 Signal
#define XBAR_CLR13_ADCB_EXTMUXSEL1   0x20000U      // Input Flag clear for ADCB_EXTMUXSEL1 Signal
#define XBAR_CLR13_ADCB_EXTMUXSEL2   0x40000U      // Input Flag clear for ADCB_EXTMUXSEL2 Signal
#define XBAR_CLR13_ADCB_EXTMUXSEL3   0x80000U      // Input Flag clear for ADCB_EXTMUXSEL3 Signal
#define XBAR_CLR13_ADCC_EXTMUXSEL0   0x100000U     // Input Flag clear for ADCC_EXTMUXSEL0 Signal
#define XBAR_CLR13_ADCC_EXTMUXSEL1   0x200000U     // Input Flag clear for ADCC_EXTMUXSEL1 Signal
#define XBAR_CLR13_ADCC_EXTMUXSEL2   0x400000U     // Input Flag clear for ADCC_EXTMUXSEL2 Signal
#define XBAR_CLR13_ADCC_EXTMUXSEL3   0x800000U     // Input Flag clear for ADCC_EXTMUXSEL3 Signal
#define XBAR_CLR13_PIEERR            0x4000000U    // Input Flag clear for PIEERR Signal
#define XBAR_CLR13_ECCERR            0x8000000U    // Input Flag clear for ECCERR Signal
#define XBAR_CLR13_EPG1_EPGOUT0      0x10000000U   // Input Flag clear for EPG1_EPGOUT0 Signal
#define XBAR_CLR13_EPG1_EPGOUT1      0x20000000U   // Input Flag clear for EPG1_EPGOUT1 Signal
#define XBAR_CLR13_EPG1_EPGOUT2      0x40000000U   // Input Flag clear for EPG1_EPGOUT2 Signal
#define XBAR_CLR13_EPG1_EPGOUT3      0x80000000U   // Input Flag clear for EPG1_EPGOUT3 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR14 register
//
//*************************************************************************************************
#define XBAR_CLR14_SD3FLT1_COMPH        0x1U          // Input Flag clear for SD3FLT1_COMPH Signal
#define XBAR_CLR14_SD3FLT1_COMPL        0x2U          // Input Flag clear for SD3FLT1_COMPL Signal
#define XBAR_CLR14_SD3FLT2_COMPH        0x4U          // Input Flag clear for SD3FLT2_COMPH Signal
#define XBAR_CLR14_SD3FLT2_COMPL        0x8U          // Input Flag clear for SD3FLT2_COMPL Signal
#define XBAR_CLR14_SD3FLT3_COMPH        0x10U         // Input Flag clear for SD3FLT3_COMPH Signal
#define XBAR_CLR14_SD3FLT3_COMPL        0x20U         // Input Flag clear for SD3FLT3_COMPL Signal
#define XBAR_CLR14_SD3FLT4_COMPH        0x40U         // Input Flag clear for SD3FLT4_COMPH Signal
#define XBAR_CLR14_SD3FLT4_COMPL        0x80U         // Input Flag clear for SD3FLT4_COMPL Signal
#define XBAR_CLR14_SD4FLT1_COMPH        0x100U        // Input Flag clear for SD4FLT1_COMPH Signal
#define XBAR_CLR14_SD4FLT1_COMPL        0x200U        // Input Flag clear for SD4FLT1_COMPL Signal
#define XBAR_CLR14_SD4FLT2_COMPH        0x400U        // Input Flag clear for SD4FLT2_COMPH Signal
#define XBAR_CLR14_SD4FLT2_COMPL        0x800U        // Input Flag clear for SD4FLT2_COMPL Signal
#define XBAR_CLR14_SD4FLT3_COMPH        0x1000U       // Input Flag clear for SD4FLT3_COMPH Signal
#define XBAR_CLR14_SD4FLT3_COMPL        0x2000U       // Input Flag clear for SD4FLT3_COMPL Signal
#define XBAR_CLR14_SD4FLT4_COMPH        0x4000U       // Input Flag clear for SD4FLT4_COMPH Signal
#define XBAR_CLR14_SD4FLT4_COMPL        0x8000U       // Input Flag clear for SD4FLT4_COMPL Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT10   0x20000U      // Input Flag clear for INPUTXBAR2_INPUT10
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT11   0x40000U      // Input Flag clear for INPUTXBAR2_INPUT11
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT12   0x80000U      // Input Flag clear for INPUTXBAR2_INPUT12
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT13   0x100000U     // Input Flag clear for INPUTXBAR2_INPUT13
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT14   0x200000U     // Input Flag clear for INPUTXBAR2_INPUT14
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT7    0x400000U     // Input Flag clear for INPUTXBAR2_INPUT7
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT8    0x800000U     // Input Flag clear for INPUTXBAR2_INPUT8
                                                      // Signal
#define XBAR_CLR14_INPUTXBAR2_INPUT9    0x1000000U    // Input Flag clear for INPUTXBAR2_INPUT9
                                                      // Signal
#define XBAR_CLR14_MCANB_FEVT0          0x2000000U    // Input Flag clear for MCANB_FEVT0 Signal
#define XBAR_CLR14_MCANB_FEVT1          0x4000000U    // Input Flag clear for MCANB_FEVT1 Signal
#define XBAR_CLR14_MCANB_FEVT2          0x8000000U    // Input Flag clear for MCANB_FEVT2 Signal
#define XBAR_CLR14_FSIA_RX_TRIG1        0x10000000U   // Input Flag clear for FSIA_RX_TRIG1 Signal
#define XBAR_CLR14_FSIB_RX_TRIG1        0x20000000U   // Input Flag clear for FSIB_RX_TRIG1 Signal
#define XBAR_CLR14_FSIC_RX_TRIG1        0x40000000U   // Input Flag clear for FSIC_RX_TRIG1 Signal
#define XBAR_CLR14_FSID_RX_TRIG1        0x80000000U   // Input Flag clear for FSID_RX_TRIG1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR15 register
//
//*************************************************************************************************
#define XBAR_CLR15_FSIRXA_TRIG_2       0x1U          // Input Flag clear for FSIRXA_TRIG_2 Signal
#define XBAR_CLR15_FSIRXA_TRIG_3       0x2U          // Input Flag clear for FSIRXA_TRIG_3 Signal
#define XBAR_CLR15_FSIRXB_TRIG_2       0x4U          // Input Flag clear for FSIRXB_TRIG_2 Signal
#define XBAR_CLR15_FSIRXB_TRIG_3       0x8U          // Input Flag clear for FSIRXB_TRIG_3 Signal
#define XBAR_CLR15_FSIRXC_TRIG_2       0x10U         // Input Flag clear for FSIRXC_TRIG_2 Signal
#define XBAR_CLR15_FSIRXC_TRIG_3       0x20U         // Input Flag clear for FSIRXC_TRIG_3 Signal
#define XBAR_CLR15_FSIRXD_TRIG_2       0x40U         // Input Flag clear for FSIRXD_TRIG_2 Signal
#define XBAR_CLR15_FSIRXD_TRIG_3       0x80U         // Input Flag clear for FSIRXD_TRIG_3 Signal
#define XBAR_CLR15_ECAP1_TRIPOUT       0x100U        // Input Flag clear for ECAP1_TRIPOUT Signal
#define XBAR_CLR15_ECAP2_TRIPOUT       0x200U        // Input Flag clear for ECAP2_TRIPOUT Signal
#define XBAR_CLR15_ECAP3_TRIPOUT       0x400U        // Input Flag clear for ECAP3_TRIPOUT Signal
#define XBAR_CLR15_ECAP4_TRIPOUT       0x800U        // Input Flag clear for ECAP4_TRIPOUT Signal
#define XBAR_CLR15_ECAP5_TRIPOUT       0x1000U       // Input Flag clear for ECAP5_TRIPOUT Signal
#define XBAR_CLR15_ECAP6_TRIPOUT       0x2000U       // Input Flag clear for ECAP6_TRIPOUT Signal
#define XBAR_CLR15_CPU1ERADEVT10       0x4000U       // Input Flag clear for CPU1ERADEVT10 Signal
#define XBAR_CLR15_CPU1ERADEVT11       0x8000U       // Input Flag clear for CPU1ERADEVT11 Signal
#define XBAR_CLR15_CPU1ERADEVT8        0x10000U      // Input Flag clear for CPU1ERADEVT8 Signal
#define XBAR_CLR15_CPU1ERADEVT9        0x20000U      // Input Flag clear for CPU1ERADEVT9 Signal
#define XBAR_CLR15_CPU1_ADCCHECKEVT1   0x40000U      // Input Flag clear for CPU1_ADCCHECKEVT1
                                                     // Signal
#define XBAR_CLR15_CPU1_ADCCHECKEVT2   0x80000U      // Input Flag clear for CPU1_ADCCHECKEVT2
                                                     // Signal
#define XBAR_CLR15_CPU1_ADCCHECKEVT3   0x100000U     // Input Flag clear for CPU1_ADCCHECKEVT3
                                                     // Signal
#define XBAR_CLR15_CPU1_ADCCHECKEVT4   0x200000U     // Input Flag clear for CPU1_ADCCHECKEVT4
                                                     // Signal
#define XBAR_CLR15_CPU2ERADEVT10       0x400000U     // Input Flag clear for CPU2ERADEVT10 Signal
#define XBAR_CLR15_CPU2ERADEVT11       0x800000U     // Input Flag clear for CPU2ERADEVT11 Signal
#define XBAR_CLR15_CPU2ERADEVT8        0x1000000U    // Input Flag clear for CPU2ERADEVT8 Signal
#define XBAR_CLR15_CPU2ERADEVT9        0x2000000U    // Input Flag clear for CPU2ERADEVT9 Signal
#define XBAR_CLR15_CPU2_ADCCHECKEVT1   0x4000000U    // Input Flag clear for CPU2_ADCCHECKEVT1
                                                     // Signal
#define XBAR_CLR15_CPU2_ADCCHECKEVT2   0x8000000U    // Input Flag clear for CPU2_ADCCHECKEVT2
                                                     // Signal
#define XBAR_CLR15_CPU2_ADCCHECKEVT3   0x10000000U   // Input Flag clear for CPU2_ADCCHECKEVT3
                                                     // Signal
#define XBAR_CLR15_CPU2_ADCCHECKEVT4   0x20000000U   // Input Flag clear for CPU2_ADCCHECKEVT4
                                                     // Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR16 register
//
//*************************************************************************************************
#define XBAR_CLR16_CMPSS9_CTRIPH       0x1U          // Input Flag clear for CMPSS9_CTRIPH Signal
#define XBAR_CLR16_CMPSS9_CTRIPL       0x2U          // Input Flag clear for CMPSS9_CTRIPL Signal
#define XBAR_CLR16_CMPSS9_CTRIPOUTH    0x4U          // Input Flag clear for CMPSS9_CTRIPOUTH
                                                     // Signal
#define XBAR_CLR16_CMPSS9_CTRIPOUTL    0x8U          // Input Flag clear for CMPSS9_CTRIPOUTL
                                                     // Signal
#define XBAR_CLR16_CMPSS10_CTRIPH      0x10U         // Input Flag clear for CMPSS10_CTRIPH Signal
#define XBAR_CLR16_CMPSS10_CTRIPL      0x20U         // Input Flag clear for CMPSS10_CTRIPL Signal
#define XBAR_CLR16_CMPSS10_CTRIPOUTH   0x40U         // Input Flag clear for CMPSS10_CTRIPOUTH
                                                     // Signal
#define XBAR_CLR16_CMPSS10_CTRIPOUTL   0x80U         // Input Flag clear for CMPSS10_CTRIPOUTL
                                                     // Signal
#define XBAR_CLR16_CMPSS11_CTRIPH      0x100U        // Input Flag clear for CMPSS11_CTRIPH Signal
#define XBAR_CLR16_CMPSS11_CTRIPL      0x200U        // Input Flag clear for CMPSS11_CTRIPL Signal
#define XBAR_CLR16_CMPSS11_CTRIPOUTH   0x400U        // Input Flag clear for CMPSS11_CTRIPOUTH
                                                     // Signal
#define XBAR_CLR16_CMPSS11_CTRIPOUTL   0x800U        // Input Flag clear for CMPSS11_CTRIPOUTL
                                                     // Signal
#define XBAR_CLR16_CMPSS12_CTRIPH      0x1000U       // Input Flag clear for CMPSS12_CTRIPH Signal
#define XBAR_CLR16_CMPSS12_CTRIPL      0x2000U       // Input Flag clear for CMPSS12_CTRIPL Signal
#define XBAR_CLR16_CMPSS12_CTRIPOUTH   0x4000U       // Input Flag clear for CMPSS12_CTRIPOUTH
                                                     // Signal
#define XBAR_CLR16_CMPSS12_CTRIPOUTL   0x8000U       // Input Flag clear for CMPSS12_CTRIPOUTL
                                                     // Signal
#define XBAR_CLR16_CLB5_4_1            0x8000000U    // Input Flag clear for CLB5_4_1  Signal
#define XBAR_CLR16_CLB5_5_1            0x10000000U   // Input Flag clear for CLB5_5_1 Signal
#define XBAR_CLR16_CLB6_4_1            0x20000000U   // Input Flag clear for CLB6_4_1 Signal
#define XBAR_CLR16_CLB6_5_1            0x40000000U   // Input Flag clear for CLB6_5_1 Signal
#define XBAR_CLR16_XCLKOUT             0x80000000U   // Input Flag clear for XCLKOUT Signal



#endif
